name: "preprocess"
backend: "python"
max_batch_size: 0
input [
  {
    name: "RAW_IMAGE" 
    data_type: TYPE_UINT8
    dims: [-1,-1,3]  
  }
]
output [
  {
    name: "PREPROCESSED_OUTPUT" 
    data_type: TYPE_FP32
    dims: [1,3,640,640]
  }
]

parameters: {
  key: "FORCE_CPU_ONLY_INPUT_TENSORS"
  value: { string_value: "no" }
}