name: "base"
backend: "pytorch"
input [
  {
    name: "INPUT__0" 
    data_type: TYPE_FP32
    dims: [1,3,640,640]  
  }
]
output [
  {
    name: "OUTPUT__0" 
    data_type: TYPE_FP32
    dims: [1,25500,11]
  }
]

version_policy: { all {} }