name: "ensembleYolo"
platform: "ensemble"
max_batch_size: 0

input: [
    {
        name: "IMAGE"
        data_type: TYPE_UINT8
        dims: [-1,-1,3]
    }
]

output: [
    {
        name: "OUTPUT_TENSOR"
        data_type: TYPE_FP32
        dims: [-1,6]
    }
]

ensemble_scheduling {
    step [
        {
            model_name: "preprocess"
            model_version: -1
            input_map {
                key: "RAW_IMAGE"
                value: "IMAGE"
            }
            output_map {
                key: "PREPROCESSED_OUTPUT"
                value: "preprocessed_image"
            }
        },
        {
            model_name: "yolo",
            model_version: 3
            input_map {
                key: "images"
                value: "preprocessed_image"
            }
            output_map {
                key: "output0"
                value: "inference_output"
            }
        },
        {
            model_name: "postprocess",
            model_version: -1
            input_map {
                key: "POSTPROCESS_INPUT"
                value: "inference_output"
            }
            output_map {
                key: "POSTPROCESSED_OUTPUT"
                value: "OUTPUT_TENSOR"
            }
        }
    ]
}